</s>
<unk>
the
there
was
a
were
in
of
and
cars
to
on
crossing
pedestrians
front
traffic
car
him
at
intersection
road
driver
lane
pedestrian
stop
light
street
driving
right
parked
his
other
he
sign
left
crosswalk
stopped
that
red
side
no
it
had
for
turn
parking
crossed
turning
turned
could
vehicles
lot
cross
ahead
as
out
vehicle
walking
nothing
through
into
both
from
bike
not
people
with
have
truck
operation
sides
affected
would
lanes
oncoming
around
before
construction
person
affect
many
events
down
be
passing
sun
might
which
when
wait
by
or
way
another
opposite
so
waiting
several
along
going
an
bicyclist
heavy
one
green
sidewalk
area
pulled
coming
passed
two
bus
also
made
see
walk
cyclist
moving
across
some
driver's
did
while
but
lots
slow
bicycle
very
biker
dark
direction
up
narrow
next
straight
yellow
after
then
riding
lights
clear
stoplight
first
if
anything
making
middle
onto
hand
van
this
well
busy
all
went
roundabout
impeded
driver`s
waited
speed
came
slowed
signs
been
behind
who
because
drove
someone
go
getting
approaching
stopping
man
pulling
operations
signal
cones
their
yield
where
walked
glare
needed
multiple
didn't
surroundings
bicyclists
near
make
crosswalks
outside
bikes
over
space
any
drive
either
large
trying
pass
changed
zone
close
raining
saw
hard
intersections
bikers
only
lighting
few
difficult
merging
white
backing
conditions
appeared
line
work
spot
wasn't
caused
slowly
time
nearby
back
fast
view
them
entering
moved
forward
watch
directly
roadway
hit
move
about
too
second
just
drivers
merged
off
path
proceeded
directions
ego-car
blocking
poor
cyclists
alongside
cause
got
flashing
backed
without
curb
setting
get
changing
trees
due
dog
visibility
sidewalks
looked
running
they
little
bright
affecting
same
4
low
bit
slowing
causing
three
entered
approached
wet
beside
none
eyes
using
railroad
circle
rider
seemed
school
ran
2
corner
complete
pedestrains
started
residential
bump
four
shadows
proceeding
pull
suv
proceed
standing
merge
like
hump
marked
riders
cart
between
come
moderate
woman
continued
video
day
present
dusk
bicycles
until
possible
black
stroller
amount
more
highway
towards
lines
trucks
closed
roads
keep
enter
than
far
really
park
opposing
spots
each
already
change
must
small
tracks
pretty
numerous
cut
surrounding
end
sure
lady
building
delivery
suddenly
its
travelling
golf
concerns
should
almost
shining
safe
distance
accident
quickly
worker
round
exiting
note
being
her
couple
motorcycle
driveway
attempting
dangerous
arrow
scenario
shoulder
incoming
vision
couldn't
exit
buses
beginning
else
distracting
workers
flow
train
obstacles
parallel
4-way
jogger
main
directing
watched
curve
children
streets
prior
significant
sunny
attention
look
big
cautious
traveling
rode
including
completely
need
curved
able
painted
much
caution
travel
adjacent
prevented
silver
dogs
impeding
fairly
possibly
passenger
braking
row
police
monitor
wide
spaces
median
different
double
u-turn
let
barriers
clearly
partially
glaring
problem
windshield
good
speeds
talking
forced
rotary
kept
normal
skateboarder
congested
following
blocked
3
walkway
tight
neighborhood
center
last
required
once
weren't
danger
distractions
allow
route
reached
limited
motorcyclist
aware
brake
wrong
rain
breaks
slightly
switched
working
crossings
concern
observe
situation
except
starting
full
put
door
event
surrounded
hill
noted
toward
sight
preventing
high
round-about
instead
hindering
factors
circumstances
charging
wanted
took
do
yielded
headlights
potentially
night
sunlight
faster
turns
passengers
four-way
looking
quite
thing
long
those
walks
since
tried
shade
guy
leading
immediate
electric
closely
during
unloading
brakes
continuing
rainy
problems
bird
leaving
use
orange
flew
immediately
avoid
slight
weather
noticed
limit
under
every
even
here
room
arrived
though
bad
away
unable
signals
cone
things
stuck
two-way
slower
ended
still
mail
remained
potential
roadside
later
sunset
ground
designated
could've
dangers
these
enough
longer
again
further
eye
stayed
foot
trailer
reason
attendant
number
store
obstructed
paths
impact
abruptly
wouldn't
biking
ready
semi
perpendicular
driveways
issues
indicating
entire
pushing
shaded
areas
blinker
opening
group
taking
safely
began
cross-traffic
garage
fedex
stay
order
barrier
somewhat
tree
blinking
never
gave
visible
flagman
medium
attempted
one-way
accidentally
cloudy
box
extra
allowed
switch
happened
city
sat
equipment
especially
steady
paying
harsh
pay
left-hand
delayed
darker
forcing
case
condition
fence
what
exited
followed
rather
short
reversing
done
most
scooter
failed
pickup
initially
reverse
whole
point
hitting
empty
rear
continue
braked
run
block
directed
constant
poles
upcoming
buildings
hazard
cutting
obstructions
angle
pause
jam
watching
glared
less
sky
guard
on-coming
humps
ups
active
kids
jogging
impair
break
roundabouts
top
tow
flags
nobody
plenty
folks
fair
rolled
tough
child
showing
rail
board
pavement
confusing
carts
everything
post
uneven
bicycler
jaywalking
minute
posts
appear
congestion
visual
everywhere
how
vicinity
sooner
markings
earlier
motion
anyone
switching
ambulance
lighted
ways
notice
pole
unusual
collided
shops
driven
persons
facing
reduced
happening
general
sitting
past
section
public
movement
operating
taken
particular
keeping
late
instructions
presented
everyone
moderately
part
constructions
lit
interfered
carefully
distraction
activity
dump
throughout
fire
pace
moment
levels
impede
multi-lane
mindful
single
warning
prepared
carrying
walker
try
reaching
valet
flowing
great
illegal
camera
baby
something
minivan
lined
skateboard
times
curves
shopping
she
temporarily
utilizing
harder
shuttle
upon
effect
trash
intersection;
additional
biggest
places
smooth
poorly
speeded
sped
joggers
men
dry
bumpy
separated
glass
word
third
directional
crew
effects
sliver
used
dawn
caught
walkers
electronic
navigate
seen
relatively
-
blue
object
metal
swerved
freeway
crossways
observed
decided
said
pets
confusion
however
picking
against
2nd
motorist
intersecting
wheel
opportunity
preceeding
hilly
officer
old
permitted
afternoon
uncontrolled
constantly
head
ford
inside
dimly
on-ramp
it's
equipments
mild
pedestirans
chair
environment
jogged
dim
prevent
hindered
filled
unsure
water
entrance
downtown
confused
paused
divided
such
yielding
pointed
half
twilight
nor
girl
morning
shown
opened
bumps
blind
open
checked
indicate
alley
ideal
wanting
maneuvering
interstate
closure
jumped
one-lane
impediments
careful
eventually
trip
finish
cease
pedestrain
early
obstruct
xing
right-hand
stops
on-street
broken
jeep
your
hazards
start
deep
briefly
waving
u
lining
flashers
mph
skate
strong
red-light
family
transit
obstructing
minor
sudden
transportation
sharp
influenced
breaking
speeding
waved
crowded
shady
playing
major
installed
25
actually
detour
easily
fully
beyond
leave
issue
bushes
bumper
least
mini
kind
swerve
fading
depending
impacting
dividing
set
individual
various
available
missing
barely
load
whatever
vans
shift
veered
shorter
higher
cement
alert
lower
clearance
stating
letting
emergency
3-way
minimal
completing
garbage
downhill
marking
inched
properly
posted
influence
definitely
electrical
nice
allowing
land
putting
exits
car's
seconds
commercial
others
motor
right-of-way
occurred
anywhere
delay
slamming
circular
pedistrian
impaired
close-by
doing
our
barricades
travelled
final
reversed
unexpectedly
steep
lightly
sedan
rough
roadwork
ramp
narrowed
addition
decent
angled
thus
surface
perhaps
frequently
crossroad
accessible
intersection)
tricky
hazardous
campus
effected
illegally
cliff
2-way
portion
obstruction
saved
stright
splitting
exits/entries
distractive
encounter
guiding
throught
likely
aother
new
increasing
jaywalked
possibility
pedestrian's
items
leaves
moveed
changes
slating
saidewalk
occupying
noting
overhead
type
permits
worn
my
indicated
give
walkways
want
gate
ordinary
scooters
pizza
jumping
car-lined
entrances
cross-walk
thee
disturb
haphazardly
right-to-left
preceded
motorized
contend
encourage
created
grade
unlit
featured
thick
hydrant
service
rates
inflow
blindspot
contruction
bridge
mind
advising
leafs
stalls
seem
stoplights
completed
unsecured
circled
two-lane
points
saying
colors
bicycle-shared
layout
delays
green;
zipping
honda
requried
semi-residential
covering
boarder
flagger
twice
blew
human
biker's
bed
jetting
example
previous
approach
handful
steet
ws
received
irregular
country
planned
unprotected
location
families
sunshine
applied
east
abrupt
wallking
pavements
biclyclist
kid
pedestirnas
raindrops
shadowed
farther
visability
yet
secure
monitored
dining
has
casting
dirver
crossway
occurring
majored
deal
handing
ice
rerouting
disappeared
speak
defensive
ensure
horizon
islands
strangely
strert
fork
blindness
devices
tell
back-up
'keep
sticks
mulitple
check
dotted
holding
rolling
together
padestrian
flash
charge
sigh
level
bulldozer
along-side
peds
eating
tarmac
hummer
alone
windshied
impacted
usually
weird
uphill
he`s
bended
streetcar
sports
live
sharing
apparent
hesitated
incidents
can
dedicated
cricle
grassy
stream
mirrors
dropped
till
skater
optimal
divider
staying
motorists
crashed
shinning
birds
window
awared
apces
tere
drop
arrows
repaired
skateboarded
significantly
populated
catching
sunrise
interference
contained
centerline
curbs
jaywalk
care
sign/intersection
drizzling
place
think
plastic
streetlight
legally
mostly
require
crossroads
cards
gathering
locations
winding
rained
take
blinding
begin
track
padestrians
paid
cleared
whichthe
foward
inresection
cautioned
viewpoint
soon
three-lane
worried
miles
finishing
college
acrossed
railway
can't
semi-trucks
150
color
pot
moreover
writing
considering
cycling
stretch
west
markedly
mark
pedesrtians
unsafe
pilot
pram
(stopped
ongoing
jaywalkers
cross-walks
pressing
utill
movements
sweeper
closest
someon
decently
trains
outdoor
motobike
multi-lanes
rest
street-bike
guides
halfway
thinking
seems
ther
wall
read
grid
postal
turnning
incidences
stationary
redlight
(looked
pylons
business
malfunctioning
notable
conducting
island
underway
mixed
backup
barrels
ladies
rising
dawned
distracted
lawfully
gone
videos
momentarily
speedbump
skateboarders
incorrect
bicycling
drivert
5
you
separate
walk;
calls
unload
curvy
pedestriane
original
lack
swerving
debris
allowances
tail
fall
awful
drop-off
gardener
quicker
omeone
crosssing
pedestrians/cyclists
rate
carriages
impedment
stood
darkness
brief
slippery
all-way
detoured
trunk
experience
periodic
pick
action
would've
sticking
ridding
distinct
destination
stucked
basically
hurry
town
gravel
hour
intercepted
beautiful
interfereneces
challenging
collision
influences
okay
rained)
response
(at
don't
disabled
cross-walk)
lookout
hurting
evening
obeyed
bigger
(but
tilted
slowdown
extended
divide
bothsides
safety
houses
bumped
pedistrians
needing
terrible
conducted
forwards
unexpected
rails
rerouted
miss
overrode
paint
approaching/passing
signaling
grew
grey
treated
crosswallk
risky
overcast
randomly
substantial
wipers
built
play
medians
reach
nighttime
extremely
sometimes
gold
excessive
fine
giant
grocery
hid
preparing
motorcycles
restaurants
carpool
bare
consecutive
opposition
invisible
became
patiently
consuming
runner
brick
suspicious
solid
expanded
pressed
outskirt
therer
infront
encountered
rid
hard-to-move
clear'
strips
curbside
anybody
concrete
edge
quarters
alternative
tables
alternate
pillars
trafffic
bin
shading
disrepair
vechicles
indication
stagnating
palm
accelerate
mirror
mustang
pet
decision
per
good!
ped
fragments
performed
step
obscured
repair
semi-dark
taillights
sneaky
darknesss
hoped
restarted
cautiously
bell
rainbow
fixing
helping
meaning
holes
impatient
fitted
having
windsheild
particularly
compact
carelessly
wished
huddled
bycicles
jump
picked
giving
comed
chose
sins
consideration
30
bycyclc
decrease
limo
tools
expressway
sort
trail
mid-turn
intersection's
women
ride
obvious
thin
closing
control
process
lock
campers
six
animal
panic
(pedestrians)
coast
therewere
bunch
relativity
choose
stalled
covered
crash
straddling
warned
separating
bag
hedges
occupied
delegated
resumed
vehicular
retail
crossguard
confuse
scene
aisles
mass-transportation
three-way
umbrellas
behaved
double-parked
paved
exactly
reflecting
flashed
flasher
steer
collecting
suns
eight
plus
why
cellphone
face
normally
predesterian
cones/workers
chances
employee
meant
probably
gray
intersection/stop
spotted
skateboarding
operated
packed
side-walk
written
deliver
interfere
nightfall
observable
limits
otherwise
adjusted
pedestians
bicyclers
narrower
convertible
mailman
slowlt
shoulders
controlled
stationed
deer
yeild
veer
clearer
will
site
parts
slammed
glares
judgment
reflection
thought
position
breaker
usual
taller
stores
drunk
runners
sparking
obeied
checking
know
accelerating
flickering
become
works
smoothly
searching
home
unpredictable
broad
chains
hinder
blowing
bicylists
speeders
prohibited
hiding
actual
dump-truck
own
childrens
there!
female
volume
whether
display
avoided
pedistrain
variety
45
gap
accidents
splited